// Напишите программу, которая выводит третью цифру заданного числа
// или сообщает, что третьей цифры нет.

Console.WriteLine("Enter number: ");
int number = Convert.ToInt32(Console.ReadLine());
int numb3 (string massage)
{
    if (number < 100)
}